## Importar pandas

In [1]:
import pandas as pd

## Ler DataFrame de arquivo CSV

In [2]:
data = pd.read_csv('titanic/train.csv')

## Primeiras Linhas

In [3]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

## Ãšltimas Linhas

In [4]:
data.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

## InformaÃ§Ãµes do DataFrame

In [5]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.6+ KB

## Resumo EstatÃ­stico de Campos NumÃ©ricos

In [6]:
data.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

## Resumo estatÃ­stico de campos CategÃ³ricos

In [7]:
data.describe(include='O')

                     Name   Sex Ticket    Cabin Embarked
count                 891   891    891      204      889
unique                891     2    681      147        3
top     Jonsson, Mr. Carl  male   1601  B96 B98        S
freq                    1   577      7        4      644

## Renomear colunas

In [8]:
data.rename({'Name': 'Nome', 'Sex': 'Sexo'}, axis=1, inplace=True)

In [9]:
data.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Nome', 'Sexo', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [10]:
data.columns = ['IdPassageiro', 'Sobreviveu', 'Classe', 'Nome', 'Sexo', 'Idade', 'IrmaosConjuge',
       'PaisFilhos', 'Bilhete', 'Tarifa', 'Cabine', 'Embarque']

In [11]:
data.columns

Index(['IdPassageiro', 'Sobreviveu', 'Classe', 'Nome', 'Sexo', 'Idade',
       'IrmaosConjuge', 'PaisFilhos', 'Bilhete', 'Tarifa', 'Cabine',
       'Embarque'],
      dtype='object')

# Selecionar Colunas EspecÃ­ficas

In [12]:
data[['Nome', 'Sexo', 'Classe', 'Tarifa', 'Idade', 'Sobreviveu']].head()

,Nome,Sexo,Classe,Tarifa,Idade,Sobreviveu
0,"Braund, Mr. Owen Harris",male,3,7.2500,22.0,0
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,1,71.2833,38.0,1
2,"Heikkinen, Miss. Laina",female,3,7.9250,26.0,1
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,1,53.1000,35.0,1
4,"Allen, Mr. William Henry",male,3,8.0500,35.0,0

## Selecionando apenas uma coluna - Data Series

In [13]:
# Dataframe
data[['Sexo']].head()

# Data Series
# data[['Sexo']].head()

     Sexo
0    male
1  female
2  female
3  female
4    male

## FunÃ§Ãµes matemÃ¡ticas embutidas

In [14]:
data['Idade'].mean()

29.69911764705882

In [15]:
data['Idade'].sum()

21205.17

In [16]:
data['Idade'].count()

714

In [17]:
data['Idade'].median()

28.0

In [18]:
data['Idade'].mode()

0    24.0
dtype: float64

In [19]:
data['Idade'].max()

80.0

In [20]:
data['Idade'].min()

0.42

In [21]:
data['Idade'].idxmin()

803

In [22]:
data['Idade'].idxmax()

630

In [23]:
data.mean()

IdPassageiro     446.000000
Sobreviveu         0.383838
Classe             2.308642
Idade             29.699118
IrmaosConjuge      0.523008
PaisFilhos         0.381594
Tarifa            32.204208
dtype: float64

In [24]:
data.sum()

IdPassageiro                                                397386
Sobreviveu                                                     342
Classe                                                        2057
Nome             Braund, Mr. Owen HarrisCumings, Mrs. John Brad...
Sexo             malefemalefemalefemalemalemalemalemalefemalefe...
Idade                                                      21205.2
IrmaosConjuge                                                  466
PaisFilhos                                                     340
Bilhete          A/5 21171PC 17599STON/O2. 31012821138033734503...
Tarifa                                                     28693.9
dtype: object

In [25]:
data.median()

IdPassageiro     446.0000
Sobreviveu         0.0000
Classe             3.0000
Idade             28.0000
IrmaosConjuge      0.0000
PaisFilhos         0.0000
Tarifa            14.4542
dtype: float64

In [26]:
data.min()

IdPassageiro                       1
Sobreviveu                         0
Classe                             1
Nome             Abbing, Mr. Anthony
Sexo                          female
Idade                           0.42
IrmaosConjuge                      0
PaisFilhos                         0
Bilhete                       110152
Tarifa                             0
dtype: object

## Selecionando pelo Index - iloc

In [27]:
data.iloc[[630,803],5]

630    80.00
803     0.42
Name: Idade, dtype: float64

In [28]:
data.iloc[803,:]

IdPassageiro                                 804
Sobreviveu                                     1
Classe                                         3
Nome             Thomas, Master. Assad Alexander
Sexo                                        male
Idade                                       0.42
IrmaosConjuge                                  0
PaisFilhos                                     1
Bilhete                                     2625
Tarifa                                    8.5167
Cabine                                       NaN
Embarque                                       C
Name: 803, dtype: object

In [29]:
data.iloc[1:4]

,IdPassageiro,Sobreviveu,Classe,Nome,Sexo,Idade,IrmaosConjuge,PaisFilhos,Bilhete,Tarifa,Cabine,Embarque
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S

In [30]:
data.iloc[2, 2]

3

In [31]:
data['Nome'].iloc[2]

'Heikkinen, Miss. Laina'

In [32]:
data['Nome'].iloc[data['Idade'].idxmax()]

'Barkworth, Mr. Algernon Henry Wilson'

In [33]:
data['Nome'].iloc[data['Idade'].idxmin()]

'Thomas, Master. Assad Alexander'

## Operador de seleÃ§Ã£o "loc"

In [34]:
data.loc[(data['Sexo']=='male') & (data['Idade'] > 20),['Idade', 'Sexo', 'Tarifa', 'Sobreviveu']].head()

    Idade  Sexo   Tarifa  Sobreviveu
0    22.0  male   7.2500           0
4    35.0  male   8.0500           0
6    54.0  male  51.8625           0
13   39.0  male  31.2750           0
20   35.0  male  26.0000           0

## Selecionando com mÃºltiplas condiÃ§Ãµes

In [35]:
data.loc[(data['Idade'] >=3) & (data['Idade'] <=10) & ~(data['Sobreviveu']==1), ['Idade', 'Sexo', 'Sobreviveu']]

     Idade    Sexo  Sobreviveu
24     8.0  female           0
50     7.0    male           0
63     4.0    male           0
147    9.0  female           0
171    4.0    male           0
182    9.0    male           0
278    7.0    male           0
374    3.0  female           0
419   10.0  female           0
480    9.0    male           0
541    9.0  female           0
634    9.0  female           0
787    8.0    male           0
813    6.0  female           0
819   10.0    male           0
850    4.0    male           0
852    9.0  female           0

## map e replace

In [36]:
data['Sexo'].map({'male': 'homem', 'female': 'mulher'}).head()

0     homem
1    mulher
2    mulher
3    mulher
4     homem
Name: Sexo, dtype: object

In [37]:
data['Sexo'].replace({'male': 'homem', 'female': 'mulher'}).head()

0     homem
1    mulher
2    mulher
3    mulher
4     homem
Name: Sexo, dtype: object

In [39]:
data['Sexo'].replace(['male','female'],['homem','mulher'], inplace=True)

## Groupby - Agrupar por

In [41]:
data.groupby(by='Sexo').mean()

,IdPassageiro,Sobreviveu,Classe,Idade,IrmaosConjuge,PaisFilhos,Tarifa
Sexo,,,,,,,
homem,454.147314,0.188908,2.389948,30.726645,0.429809,0.235702,25.523893
mulher,431.028662,0.742038,2.159236,27.915709,0.694268,0.649682,44.479818

In [42]:
data.groupby(by='Sobreviveu').mean()

,IdPassageiro,Classe,Idade,IrmaosConjuge,PaisFilhos,Tarifa
Sobreviveu,,,,,,
0,447.016393,2.531876,30.626179,0.553734,0.329690,22.117887
1,444.368421,1.950292,28.343690,0.473684,0.464912,48.395408

In [43]:
data.groupby('Classe').mean()

,IdPassageiro,Sobreviveu,Idade,IrmaosConjuge,PaisFilhos,Tarifa
Classe,,,,,,
1,461.597222,0.629630,38.233441,0.416667,0.356481,84.154687
2,445.956522,0.472826,29.877630,0.402174,0.380435,20.662183
3,439.154786,0.242363,25.140620,0.615071,0.393075,13.675550

In [44]:
data.groupby(['Sexo','Classe']).mean()

               IdPassageiro  Sobreviveu      Idade  IrmaosConjuge  PaisFilhos  \
Sexo   Classe
homem  1         455.729508    0.368852  41.281386       0.311475    0.278689
       2         447.962963    0.157407  30.740707       0.342593    0.222222
       3         455.515850    0.135447  26.507589       0.498559    0.224784
mulher 1         469.212766    0.968085  34.611765       0.553191    0.457447
       2         443.105263    0.921053  28.722973       0.486842    0.605263
       3         399.729167    0.500000  21.750000       0.895833    0.798611

                   Tarifa
Sexo   Classe
homem  1        67.226127
       2        19.741782
       3        12.661633
mulher 1       106.125798
       2        21.970121
       3        16.118810

## Crosstab

In [46]:
pd.crosstab(data['Sobreviveu'], data['Classe'], margins=True)

Classe        1    2    3  All
Sobreviveu
0            80   97  372  549
1           136   87  119  342
All         216  184  491  891

## Ordenando Dados

In [47]:
data[['Idade','Sexo','Classe','Sobreviveu']].sort_values(by='Classe',ascending=False)

     Idade    Sexo  Classe  Sobreviveu
0    22.00   homem       3           0
511    NaN   homem       3           0
500  17.00   homem       3           0
501  21.00  mulher       3           0
502    NaN  mulher       3           0
503  37.00  mulher       3           0
508  28.00   homem       3           0
509  26.00   homem       3           1
510  29.00   homem       3           1
514  24.00   homem       3           0
532  17.00   homem       3           0
517    NaN   homem       3           0
519  32.00   homem       3           0
521  22.00   homem       3           0
522    NaN   homem       3           0
524    NaN   homem       3           0
525  40.50   homem       3           0
528  39.00   homem       3           0
499  24.00   homem       3           0
497    NaN   homem       3           0
495    NaN   homem       3           0
494  21.00   homem       3           0
469   0.75  mulher       3           1
470    NaN   homem       3           0
471  38.00   homem       3           0
474  22.00  mulher       3           0
477  29.00   homem       3           0
478  22.00   homem       3           0
479   2.00  mulher       3           1
480   9.00   homem       3           0
..     ...     ...     ...         ...
716  38.00  mulher       1           1
467  56.00   homem       1           0
496  54.00  mulher       1           1
215  31.00  mulher       1           1
118  24.00   homem       1           0
679  36.00   homem       1           1
493  71.00   homem       1           0
681  27.00   homem       1           1
492  55.00   homem       1           0
218  32.00  mulher       1           1
487  58.00   homem       1           0
486  35.00  mulher       1           1
689  15.00  mulher       1           1
690  31.00   homem       1           1
484  25.00   homem       1           1
110  47.00   homem       1           0
694  60.00   homem       1           0
224  38.00   homem       1           1
698  49.00   homem       1           0
475    NaN   homem       1           0
700  18.00  mulher       1           1
701  35.00   homem       1           1
230  35.00  mulher       1           1
707  42.00   homem       1           1
708  22.00  mulher       1           1
102  21.00   homem       1           0
710  24.00  mulher       1           1
711    NaN   homem       1           0
712  48.00   homem       1           1
445   4.00   homem       1           1

[891 rows x 4 columns]

In [48]:
data[['Idade','Sexo','Classe','Sobreviveu']].sort_index(ascending=False).head()

     Idade    Sexo  Classe  Sobreviveu
890   32.0   homem       3           0
889   26.0   homem       1           1
888    NaN  mulher       3           0
887   19.0  mulher       1           1
886   27.0   homem       2           0

## Lidando com dados faltando $\rightarrow$ NaN - Not a Number

In [50]:
data.isnull().sum()

IdPassageiro       0
Sobreviveu         0
Classe             0
Nome               0
Sexo               0
Idade            177
IrmaosConjuge      0
PaisFilhos         0
Bilhete            0
Tarifa             0
Cabine           687
Embarque           2
dtype: int64

In [51]:
data.loc[data['Embarque'].isnull()]

,IdPassageiro,Sobreviveu,Classe,Nome,Sexo,Idade,IrmaosConjuge,PaisFilhos,Bilhete,Tarifa,Cabine,Embarque
61,62,1,1,"Icard, Miss. Amelie",mulher,38.0,0,0,113572,80.0,B28,NaN
829,830,1,1,"Stone, Mrs. George Nelson (Martha Evelyn)",mulher,62.0,0,0,113572,80.0,B28,NaN

In [52]:
data['Embarque'].unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [53]:
data['Embarque'].mode()

0    S
dtype: object

In [55]:
data['Embarque'].at[61] = 'S'

In [56]:
data['Embarque'].fillna('Q', inplace=True)

## Deletando Coluna ou Linha

In [60]:
data.isnull().sum()

IdPassageiro       0
Sobreviveu         0
Classe             0
Nome               0
Sexo               0
Idade            177
IrmaosConjuge      0
PaisFilhos         0
Bilhete            0
Tarifa             0
Cabine           687
Embarque           0
dtype: int64

In [61]:
data.drop('Cabine', axis=1, inplace=True)

In [62]:
data.isnull().sum()

IdPassageiro       0
Sobreviveu         0
Classe             0
Nome               0
Sexo               0
Idade            177
IrmaosConjuge      0
PaisFilhos         0
Bilhete            0
Tarifa             0
Embarque           0
dtype: int64

## Apply e Lambda

In [64]:
data['Idade'].apply(lambda x: x**2).head()

0     484.0
1    1444.0
2     676.0
3    1225.0
4    1225.0
Name: Idade, dtype: float64

In [66]:
data['Bilhete'] = data['Bilhete'].apply(lambda x: x[:-1])

In [68]:
data['Bilhete'].head()

0           A/5 2117
1            PC 1759
2    STON/O2. 310128
3              11380
4              37345
Name: Bilhete, dtype: object

## VariÃ¡veis Dummy | OneHotEncoder

In [72]:
data = pd.get_dummies(data, columns=['Sexo'], drop_first=True)

KeyError: "['Sexo'] not in index"

In [75]:
pd.get_dummies(data['Embarque'], drop_first=True).head()

   Q  S
0  0  1
1  0  0
2  0  1
3  0  1
4  0  1

In [76]:
embarque = pd.get_dummies(data['Embarque'], drop_first=True)

## Concatenando DataFrames

In [77]:
data.shape, embarque.shape

((891, 11), (891, 2))

In [78]:
data = pd.concat([data, embarque], axis=1)

In [79]:
data.head()

,IdPassageiro,Sobreviveu,Classe,Nome,Idade,IrmaosConjuge,PaisFilhos,Bilhete,Tarifa,Embarque,Sexo_mulher,Q,S
0,1,0,3,"Braund, Mr. Owen Harris",22.0,1,0,A/5 2117,7.2500,S,0,0,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",38.0,1,0,PC 1759,71.2833,C,1,0,0
2,3,1,3,"Heikkinen, Miss. Laina",26.0,0,0,STON/O2. 310128,7.9250,S,1,0,1
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",35.0,1,0,11380,53.1000,S,1,0,1
4,5,0,3,"Allen, Mr. William Henry",35.0,0,0,37345,8.0500,S,0,0,1

In [80]:
data.drop('Embarque', axis=1, inplace=True)

In [81]:
data.head(3)

,IdPassageiro,Sobreviveu,Classe,Nome,Idade,IrmaosConjuge,PaisFilhos,Bilhete,Tarifa,Sexo_mulher,Q,S
0,1,0,3,"Braund, Mr. Owen Harris",22.0,1,0,A/5 2117,7.2500,0,0,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",38.0,1,0,PC 1759,71.2833,1,0,0
2,3,1,3,"Heikkinen, Miss. Laina",26.0,0,0,STON/O2. 310128,7.9250,1,0,1

# ExpressÃµes Regulares

.  - qualquer caracter
<br>\d - dÃ­gitos (0-9)
<br>\D - exceto dÃ­gitos (0-9)
<br>\w - palavra (a-z, A-Z, 0-9, \_)
<br>\s - espaÃ§o em branco (tab, espaÃ§o, nova linha)
<br>\S - qualquer coisa exceto espaÃ§o em branco (tab, espaÃ§o, nova linha)
<br>\b - inÃ­cio de uma palavra
<br>\B - exceto inÃ­cio da palavra
<br>^ - inicio de uma String
<br>$ - final de uma string
<br>[] - caracteres em colchetes
<br>[^] - caracteres nÃ£o em colchetes
<br>| - ou
<br>( ) - grupo

<br>* - nenhum ou mais
<br>+ - um ou mais
<br>? - nenhum ou um
<br>{3} - nÃºmero exato
<br>{3,4} - range de NÃºmeros (mÃ­nimo, mÃ¡ximo)

ReferÃªncia (inglÃªs): 
http://bit.ly/ExpressoesRegulares

In [85]:
data['Nome'].str.extract('([a-zA-Z]+)\.').head()

      0
0    Mr
1   Mrs
2  Miss
3   Mrs
4    Mr

In [86]:
data['TÃ­tulo'] = data['Nome'].str.extract('([a-zA-Z]+)\.')

# Engenharia de Recursos - Feature Engineering

In [87]:
data['Sexo'] = data['Sexo_mulher'].map({0: 'homem', 1: 'mulher'})

In [88]:
pd.crosstab(data['TÃ­tulo'], data['Sexo'])

Sexo      homem  mulher
TÃ­tulo
Capt          1       0
Col           2       0
Countess      0       1
Don           1       0
Dr            6       1
Jonkheer      1       0
Lady          0       1
Major         2       0
Master       40       0
Miss          0     182
Mlle          0       2
Mme           0       1
Mr          517       0
Mrs           0     125
Ms            0       1
Rev           6       0
Sir           1       0

In [89]:
data['TÃ­tulo'].apply(lambda x: 'Outros' if x not in ['Master', 'Miss', 'Mr', 'Mrs'] else x)

0          Mr
1         Mrs
2        Miss
3         Mrs
4          Mr
5          Mr
6          Mr
7      Master
8         Mrs
9         Mrs
10       Miss
11       Miss
12         Mr
13         Mr
14       Miss
15        Mrs
16     Master
17         Mr
18        Mrs
19        Mrs
20         Mr
21         Mr
22       Miss
23         Mr
24       Miss
25        Mrs
26         Mr
27         Mr
28       Miss
29         Mr
        ...
861        Mr
862       Mrs
863      Miss
864        Mr
865       Mrs
866      Miss
867        Mr
868        Mr
869    Master
870        Mr
871       Mrs
872        Mr
873        Mr
874       Mrs
875      Miss
876        Mr
877        Mr
878        Mr
879       Mrs
880       Mrs
881        Mr
882      Miss
883        Mr
884        Mr
885       Mrs
886    Outros
887      Miss
888      Miss
889        Mr
890        Mr
Name: TÃ­tulo, Length: 891, dtype: object

In [90]:
data['TÃ­tulo'] = data['TÃ­tulo'].apply(lambda x: 'Outros' if x not in ['Master', 'Miss', 'Mr', 'Mrs'] else x)

In [91]:
pd.crosstab(data['TÃ­tulo'], data['Sexo'])

Sexo    homem  mulher
TÃ­tulo
Master     40       0
Miss        0     182
Mr        517       0
Mrs         0     125
Outros     20       7

## Mudando Valores Linha Por Linha - iterrows()